<abi-corpus version='2.0' path='libssl.so' architecture='elf-amd-x86_64' soname='libssl.so.3'>
  <elf-needed>
    <dependency name='libcrypto.so.3'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='BIO_f_ssl' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_buffer_ssl_connect' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_ssl' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_new_ssl_connect' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_ssl_copy_session_id' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='BIO_ssl_shutdown' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='SSL_use_certificate_file' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_use_psk_identity_hint' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_verify_client_post_handshake' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_version' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_waiting_for_async' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_want' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write_early_data' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSL_write_ex' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSLv3_client_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSLv3_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='SSLv3_server_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_client_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLS_server_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_client_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_1_server_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_client_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_2_server_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_client_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='TLSv1_server_method' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='d2i_SSL_SESSION' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='d2i_SSL_SESSION_ex' version='OPENSSL_3.2.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='i2d_SSL_SESSION' version='OPENSSL_3.0.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='crypto/packet.c' comp-dir-path='/work' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-3'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='void' id='type-id-5'/>
    <typedef-decl name='uint64_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-7'/>
    <typedef-decl name='__uint64_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-6'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-8'/>
    <class-decl name='buf_mem_st' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/openssl/buffer.h' line='42' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-8' visibility='default' filepath='include/openssl/buffer.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='include/openssl/buffer.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max' type-id='type-id-8' visibility='default' filepath='include/openssl/buffer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='include/openssl/buffer.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='BUF_MEM' type-id='type-id-9' filepath='include/openssl/types.h' line='97' column='1' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-10'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-13'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-16'/>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='ossl_quic_vlint_encode' filepath='include/internal/quic_vlint.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_quic_vlint_encode_n' filepath='include/internal/quic_vlint.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BUF_MEM_grow' filepath='include/openssl/buffer.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='CRYPTO_zalloc' filepath='include/openssl/crypto.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='CRYPTO_free' filepath='include/openssl/crypto.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto/thread/arch.c' comp-dir-path='/work' language='LANG_C11'>
    <class-decl name='ossl_lib_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-17'/>
    <typedef-decl name='uint32_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-19'/>
    <typedef-decl name='__uint32_t' type-id='type-id-20' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-18'/>
    <typedef-decl name='CRYPTO_MUTEX' type-id='type-id-5' filepath='include/internal/thread_arch.h' line='40' column='1' id='type-id-21'/>
    <typedef-decl name='CRYPTO_CONDVAR' type-id='type-id-5' filepath='include/internal/thread_arch.h' line='41' column='1' id='type-id-22'/>
    <typedef-decl name='CRYPTO_THREAD_RETVAL' type-id='type-id-19' filepath='include/internal/thread_arch.h' line='57' column='1' id='type-id-23'/>
    <typedef-decl name='CRYPTO_THREAD_ROUTINE' type-id='type-id-24' filepath='include/internal/thread_arch.h' line='58' column='1' id='type-id-25'/>
    <class-decl name='crypto_thread_st' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/internal/thread_arch.h' line='71' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-19' visibility='default' filepath='include/internal/thread_arch.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='include/internal/thread_arch.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='routine' type-id='type-id-25' visibility='default' filepath='include/internal/thread_arch.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='retval' type-id='type-id-23' visibility='default' filepath='include/internal/thread_arch.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handle' type-id='type-id-16' visibility='default' filepath='include/internal/thread_arch.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock' type-id='type-id-27' visibility='default' filepath='include/internal/thread_arch.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='statelock' type-id='type-id-27' visibility='default' filepath='include/internal/thread_arch.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='condvar' type-id='type-id-28' visibility='default' filepath='include/internal/thread_arch.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='thread_id' type-id='type-id-4' visibility='default' filepath='include/internal/thread_arch.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='joinable' type-id='type-id-2' visibility='default' filepath='include/internal/thread_arch.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ctx' type-id='type-id-29' visibility='default' filepath='include/internal/thread_arch.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='CRYPTO_THREAD' type-id='type-id-26' filepath='include/internal/thread_arch.h' line='83' column='1' id='type-id-30'/>
    <typedef-decl name='OSSL_LIB_CTX' type-id='type-id-17' filepath='include/openssl/types.h' line='218' column='1' id='type-id-31'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-24'/>
    <class-decl name='ossl_lib_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-17'/>
    <function-decl name='ossl_crypto_mutex_new' filepath='include/internal/thread_arch.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='ossl_crypto_mutex_lock' filepath='include/internal/thread_arch.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_mutex_unlock' filepath='include/internal/thread_arch.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_mutex_free' filepath='include/internal/thread_arch.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_condvar_new' filepath='include/internal/thread_arch.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='ossl_crypto_condvar_wait' filepath='include/internal/thread_arch.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_condvar_signal' filepath='include/internal/thread_arch.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_condvar_free' filepath='include/internal/thread_arch.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ossl_crypto_thread_native_spawn' filepath='include/internal/thread_arch.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='ossl_crypto_thread_native_perform_join' filepath='include/internal/thread_arch.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-36'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-23'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto/thread/arch/thread_posix.c' comp-dir-path='/work' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-37'>
      <subrange length='40' type-id='type-id-4' id='type-id-38'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-39'>
      <subrange length='48' type-id='type-id-4' id='type-id-40'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='32' id='type-id-41'>
      <subrange length='4' type-id='type-id-4' id='type-id-42'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='448' id='type-id-43'>
      <subrange length='56' type-id='type-id-4' id='type-id-44'/>
    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-45'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-46'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-47'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='64' id='type-id-48'>
      <subrange length='2' type-id='type-id-4' id='type-id-49'/>
    </array-type-def>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='25' column='1' id='type-id-51'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='type-id-46' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='27' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='type-id-52' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='32' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='28' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__atomic_wide_counter' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='33' column='1' id='type-id-50'/>
    <typedef-decl name='pthread_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-53'/>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-55'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='36' column='1' id='type-id-54'/>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='type-id-56' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='41' column='1' id='type-id-57'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='43' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_condattr_t' type-id='type-id-57' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='45' column='1' id='type-id-56'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-58'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_attr_t' type-id='type-id-58' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-60'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-61' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-62'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-37' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-62' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-61'/>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-65'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-39' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-45' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_cond_t' type-id='type-id-65' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-64'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-47' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-47' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-67' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-69' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-69' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='55' column='1' id='type-id-67'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-48' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-48' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-20' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-48' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='197' column='1' id='type-id-70'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-73'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <qualified-type-def type-id='type-id-74' restrict='yes' id='type-id-75'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-77'/>
    <qualified-type-def type-id='type-id-77' restrict='yes' id='type-id-78'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-82' restrict='yes' id='type-id-83'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-85' restrict='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-87' restrict='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-89'/>
    <qualified-type-def type-id='type-id-89' restrict='yes' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-93'/>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_exit' filepath='/usr/include/pthread.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_join' filepath='/usr/include/pthread.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='pthread_equal' filepath='/usr/include/pthread.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_attr_init' filepath='/usr/include/pthread.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_attr_destroy' filepath='/usr/include/pthread.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' filepath='/usr/include/pthread.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_trylock' filepath='/usr/include/pthread.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_init' filepath='/usr/include/pthread.h' line='1112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_destroy' filepath='/usr/include/pthread.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='1121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_broadcast' filepath='/usr/include/pthread.h' line='1125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='1133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_cond_timedwait' filepath='/usr/include/pthread.h' line='1145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='OPENSSL_die' filepath='include/openssl/crypto.h' line='416' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto/time.c' comp-dir-path='/work' language='LANG_C11'>
    <type-decl name='long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='variadic parameter type' id='type-id-95'/>
    <typedef-decl name='__time_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-72'/>
    <typedef-decl name='__suseconds_t' type-id='type-id-59' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='162' column='1' id='type-id-96'/>
    <class-decl name='timeval' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h' line='8' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-96' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-99'/>
    <qualified-type-def type-id='type-id-99' restrict='yes' id='type-id-100'/>
    <qualified-type-def type-id='type-id-16' restrict='yes' id='type-id-94'/>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='gettimeofday' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='ERR_new' filepath='include/openssl/err.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ERR_set_debug' filepath='include/openssl/err.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ERR_set_error' filepath='include/openssl/err.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ssl/bio_ssl.c' comp-dir-path='/work' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-101' size-in-bits='256' id='type-id-102'>
      <subrange length='4' type-id='type-id-4' id='type-id-42'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-103' size-in-bits='22528' id='type-id-104'>
      <subrange length='32' type-id='type-id-4' id='type-id-105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='864' id='type-id-106'>
      <subrange length='108' type-id='type-id-4' id='type-id-107'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='112' id='type-id-108'>
      <subrange length='14' type-id='type-id-4' id='type-id-109'/>
    </array-type-def>
    <class-decl name='X509_VERIFY_PARAM_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='async_job_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-111'/>
    <class-decl name='async_wait_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <class-decl name='bignum_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='bio_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='comp_method_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='ct_policy_eval_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='ctlog_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='dh_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='engine_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='evp_cipher_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='evp_cipher_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='evp_mac_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='evp_md_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='evp_md_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='evp_pkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='hmac_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='ossl_record_layer_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='pqueue_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='stack_st_OCSP_RESPID' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='stack_st_SCT' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <class-decl name='stack_st_SRTP_PROTECTION_PROFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <class-decl name='stack_st_SSL_CIPHER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
    <class-decl name='stack_st_SSL_COMP' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
    <class-decl name='stack_st_X509' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <class-decl name='stack_st_X509_EXTENSION' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
    <class-decl name='stack_st_X509_NAME' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-136'/>
    <class-decl name='stack_st_danetls_record' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
    <class-decl name='stack_st_void' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-138'/>
    <class-decl name='x509_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
    <class-decl name='x509_store_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-140'/>
    <class-decl name='x509_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
    <array-type-def dimensions='1' type-id='type-id-142' size-in-bits='1536' id='type-id-143'>
      <subrange length='24' type-id='type-id-4' id='type-id-144'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-145' size-in-bits='896' id='type-id-146'>
      <subrange length='14' type-id='type-id-4' id='type-id-109'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='448' id='type-id-147'>
      <subrange length='14' type-id='type-id-4' id='type-id-109'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' id='type-id-148'>
      <subrange length='4' type-id='type-id-4' id='type-id-42'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='896' id='type-id-149'>
      <subrange length='14' type-id='type-id-4' id='type-id-109'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='128' id='type-id-151'>
      <subrange length='8' type-id='type-id-4' id='type-id-152'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-153'>
      <subrange length='4' type-id='type-id-4' id='type-id-42'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='128' id='type-id-155'>
      <subrange length='16' type-id='type-id-4' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='232' id='type-id-157'>
      <subrange length='29' type-id='type-id-4' id='type-id-158'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-159'/>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='1024' id='type-id-160'>
      <subrange length='128' type-id='type-id-4' id='type-id-161'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-162'>
      <subrange length='16' type-id='type-id-4' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='2040' id='type-id-163'>
      <subrange length='255' type-id='type-id-4' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='16' id='type-id-165'>
      <subrange length='2' type-id='type-id-4' id='type-id-49'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='256' id='type-id-166'>
      <subrange length='32' type-id='type-id-4' id='type-id-105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='32' id='type-id-167'>
      <subrange length='4' type-id='type-id-4' id='type-id-42'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='4096' id='type-id-168'>
      <subrange length='512' type-id='type-id-4' id='type-id-169'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='512' id='type-id-170'>
      <subrange length='64' type-id='type-id-4' id='type-id-171'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='64' id='type-id-172'>
      <subrange length='8' type-id='type-id-4' id='type-id-152'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-173'/>
    <typedef-decl name='in_addr_t' type-id='type-id-19' filepath='/usr/include/netinet/in.h' line='30' column='1' id='type-id-174'/>
    <class-decl name='in_addr' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='31' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='type-id-174' visibility='default' filepath='/usr/include/netinet/in.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='in_port_t' type-id='type-id-150' filepath='/usr/include/netinet/in.h' line='123' column='1' id='type-id-176'/>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='219' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-178' visibility='default' filepath='/usr/include/netinet/in.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='221' column='1' id='type-id-178'>
      <data-member access='public'>
        <var-decl name='__u6_addr8' type-id='type-id-155' visibility='default' filepath='/usr/include/netinet/in.h' line='223' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr16' type-id='type-id-151' visibility='default' filepath='/usr/include/netinet/in.h' line='224' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr32' type-id='type-id-153' visibility='default' filepath='/usr/include/netinet/in.h' line='225' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='sockaddr_in' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='245' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin_family' type-id='type-id-180' visibility='default' filepath='/usr/include/netinet/in.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin_port' type-id='type-id-176' visibility='default' filepath='/usr/include/netinet/in.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin_addr' type-id='type-id-175' visibility='default' filepath='/usr/include/netinet/in.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin_zero' type-id='type-id-172' visibility='default' filepath='/usr/include/netinet/in.h' line='252' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_in6' size-in-bits='224' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='260' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin6_family' type-id='type-id-180' visibility='default' filepath='/usr/include/netinet/in.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin6_port' type-id='type-id-176' visibility='default' filepath='/usr/include/netinet/in.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin6_flowinfo' type-id='type-id-19' visibility='default' filepath='/usr/include/netinet/in.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin6_addr' type-id='type-id-177' visibility='default' filepath='/usr/include/netinet/in.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sin6_scope_id' type-id='type-id-19' visibility='default' filepath='/usr/include/netinet/in.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-4' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-182'/>
    <typedef-decl name='sa_family_t' type-id='type-id-173' filepath='/usr/include/x86_64-linux-gnu/bits/sockaddr.h' line='28' column='1' id='type-id-180'/>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='180' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-180' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-108' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='183' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-184' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-185'/>
    <typedef-decl name='uint8_t' type-id='type-id-186' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-154'/>
    <typedef-decl name='uint16_t' type-id='type-id-187' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-150'/>
    <typedef-decl name='__uint8_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-186'/>
    <typedef-decl name='__uint16_t' type-id='type-id-173' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-187'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-184'/>
    <typedef-decl name='time_t' type-id='type-id-72' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-188'/>
    <class-decl name='sockaddr_un' size-in-bits='880' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='29' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sun_family' type-id='type-id-180' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sun_path' type-id='type-id-106' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/un.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bio_method_st' size-in-bits='896' is-struct='yes' visibility='default' filepath='include/internal/bio.h' line='17' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-2' visibility='default' filepath='include/internal/bio.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-10' visibility='default' filepath='include/internal/bio.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bwrite' type-id='type-id-191' visibility='default' filepath='include/internal/bio.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bwrite_old' type-id='type-id-192' visibility='default' filepath='include/internal/bio.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bread' type-id='type-id-193' visibility='default' filepath='include/internal/bio.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bread_old' type-id='type-id-194' visibility='default' filepath='include/internal/bio.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bputs' type-id='type-id-195' visibility='default' filepath='include/internal/bio.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bgets' type-id='type-id-194' visibility='default' filepath='include/internal/bio.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ctrl' type-id='type-id-196' visibility='default' filepath='include/internal/bio.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='create' type-id='type-id-197' visibility='default' filepath='include/internal/bio.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='destroy' type-id='type-id-197' visibility='default' filepath='include/internal/bio.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='callback_ctrl' type-id='type-id-198' visibility='default' filepath='include/internal/bio.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bsendmmsg' type-id='type-id-199' visibility='default' filepath='include/internal/bio.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='brecvmmsg' type-id='type-id-199' visibility='default' filepath='include/internal/bio.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='bio_addr_st' size-in-bits='896' visibility='default' filepath='include/internal/bio_addr.h' line='17' column='1' id='type-id-200'>
      <data-member access='public'>
        <var-decl name='sa' type-id='type-id-183' visibility='default' filepath='include/internal/bio_addr.h' line='18' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_in6' type-id='type-id-181' visibility='default' filepath='include/internal/bio_addr.h' line='20' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_in' type-id='type-id-179' visibility='default' filepath='include/internal/bio_addr.h' line='22' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_un' type-id='type-id-189' visibility='default' filepath='include/internal/bio_addr.h' line='24' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='danetls_record_st' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='43' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usage' type-id='type-id-154' visibility='default' filepath='include/internal/dane.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='selector' type-id='type-id-154' visibility='default' filepath='include/internal/dane.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mtype' type-id='type-id-154' visibility='default' filepath='include/internal/dane.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-15' visibility='default' filepath='include/internal/dane.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dlen' type-id='type-id-8' visibility='default' filepath='include/internal/dane.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='spki' type-id='type-id-202' visibility='default' filepath='include/internal/dane.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='danetls_record' type-id='type-id-201' filepath='include/internal/dane.h' line='50' column='1' id='type-id-203'/>
    <class-decl name='dane_ctx_st' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='57' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mdevp' type-id='type-id-205' visibility='default' filepath='include/internal/dane.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mdord' type-id='type-id-206' visibility='default' filepath='include/internal/dane.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mdmax' type-id='type-id-154' visibility='default' filepath='include/internal/dane.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='include/internal/dane.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_dane_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/internal/dane.h' line='67' column='1' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dctx' type-id='type-id-208' visibility='default' filepath='include/internal/dane.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trecs' type-id='type-id-209' visibility='default' filepath='include/internal/dane.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='certs' type-id='type-id-210' visibility='default' filepath='include/internal/dane.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtlsa' type-id='type-id-211' visibility='default' filepath='include/internal/dane.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mcert' type-id='type-id-212' visibility='default' filepath='include/internal/dane.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='umask' type-id='type-id-19' visibility='default' filepath='include/internal/dane.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='mdpth' type-id='type-id-2' visibility='default' filepath='include/internal/dane.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pdpth' type-id='type-id-2' visibility='default' filepath='include/internal/dane.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-4' visibility='default' filepath='include/internal/dane.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PACKET' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-213' visibility='default' filepath='include/internal/packet.h' line='22' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='curr' type-id='type-id-215' visibility='default' filepath='include/internal/packet.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remaining' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PACKET' type-id='type-id-214' filepath='include/internal/packet.h' line='27' column='1' id='type-id-213'/>
    <typedef-decl name='WPACKET_SUB' type-id='type-id-216' filepath='include/internal/packet.h' line='632' column='1' id='type-id-217'/>
    <class-decl name='wpacket_sub' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/internal/packet.h' line='633' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-218' visibility='default' filepath='include/internal/packet.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='packet_len' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lenbytes' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pwritten' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-20' visibility='default' filepath='include/internal/packet.h' line='650' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='WPACKET' type-id='type-id-219' filepath='include/internal/packet.h' line='653' column='1' id='type-id-220'/>
    <class-decl name='wpacket_st' size-in-bits='448' is-struct='yes' visibility='default' filepath='include/internal/packet.h' line='654' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-12' visibility='default' filepath='include/internal/packet.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='staticbuf' type-id='type-id-15' visibility='default' filepath='include/internal/packet.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='curr' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='written' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='maxsize' type-id='type-id-8' visibility='default' filepath='include/internal/packet.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='subs' type-id='type-id-218' visibility='default' filepath='include/internal/packet.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='endfirst' type-id='type-id-20' visibility='default' filepath='include/internal/packet.h' line='677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OSSL_RECORD_METHOD' type-id='type-id-221' filepath='include/internal/recordmethod.h' line='31' column='1' id='type-id-222'/>
    <typedef-decl name='OSSL_RECORD_LAYER' type-id='type-id-127' filepath='include/internal/recordmethod.h' line='37' column='1' id='type-id-223'/>
    <class-decl name='ossl_record_template_st' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/internal/recordmethod.h' line='65' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-3' visibility='default' filepath='include/internal/recordmethod.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='version' type-id='type-id-20' visibility='default' filepath='include/internal/recordmethod.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buf' type-id='type-id-215' visibility='default' filepath='include/internal/recordmethod.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buflen' type-id='type-id-8' visibility='default' filepath='include/internal/recordmethod.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OSSL_RECORD_TEMPLATE' type-id='type-id-224' filepath='include/internal/recordmethod.h' line='72' column='1' id='type-id-225'/>
    <class-decl name='ossl_record_method_st' size-in-bits='1600' is-struct='yes' visibility='default' filepath='include/internal/recordmethod.h' line='88' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='new_record_layer' type-id='type-id-226' visibility='default' filepath='include/internal/recordmethod.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unprocessed_read_pending' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='processed_read_pending' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_data_pending' type-id='type-id-228' visibility='default' filepath='include/internal/recordmethod.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_max_records' type-id='type-id-229' visibility='default' filepath='include/internal/recordmethod.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_records' type-id='type-id-230' visibility='default' filepath='include/internal/recordmethod.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='retry_write_records' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_record' type-id='type-id-231' visibility='default' filepath='include/internal/recordmethod.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='release_record' type-id='type-id-232' visibility='default' filepath='include/internal/recordmethod.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_alert_code' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='set1_bio' type-id='type-id-233' visibility='default' filepath='include/internal/recordmethod.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='set_protocol_version' type-id='type-id-234' visibility='default' filepath='include/internal/recordmethod.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='set_plain_alerts' type-id='type-id-235' visibility='default' filepath='include/internal/recordmethod.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_first_handshake' type-id='type-id-235' visibility='default' filepath='include/internal/recordmethod.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='set_max_pipelines' type-id='type-id-236' visibility='default' filepath='include/internal/recordmethod.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_in_init' type-id='type-id-235' visibility='default' filepath='include/internal/recordmethod.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='get_state' type-id='type-id-237' visibility='default' filepath='include/internal/recordmethod.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='set_options' type-id='type-id-238' visibility='default' filepath='include/internal/recordmethod.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_compression' type-id='type-id-239' visibility='default' filepath='include/internal/recordmethod.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='set_max_frag_len' type-id='type-id-236' visibility='default' filepath='include/internal/recordmethod.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='get_max_record_overhead' type-id='type-id-228' visibility='default' filepath='include/internal/recordmethod.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='increment_sequence_ctr' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='alloc_buffers' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='free_buffers' type-id='type-id-227' visibility='default' filepath='include/internal/recordmethod.h' line='328' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='CRYPTO_REF_COUNT' size-in-bits='32' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='include/internal/refcount.h' line='29' column='1' id='type-id-241'/>
    <typedef-decl name='CRYPTO_REF_COUNT' type-id='type-id-241' filepath='include/internal/refcount.h' line='31' column='1' id='type-id-240'/>
    <typedef-decl name='ossl_msg_cb' type-id='type-id-242' filepath='include/internal/ssl.h' line='16' column='1' id='type-id-243'/>
    <enum-decl name='WORK_STATE' naming-typedef-id='type-id-244' filepath='include/internal/statem.h' line='22' column='1' id='type-id-245'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='WORK_ERROR' value='0'/>
      <enumerator name='WORK_FINISHED_STOP' value='1'/>
      <enumerator name='WORK_FINISHED_CONTINUE' value='2'/>
      <enumerator name='WORK_MORE_A' value='3'/>
      <enumerator name='WORK_MORE_B' value='4'/>
      <enumerator name='WORK_MORE_C' value='5'/>
    </enum-decl>
    <typedef-decl name='WORK_STATE' type-id='type-id-245' filepath='include/internal/statem.h' line='35' column='1' id='type-id-244'/>
    <enum-decl name='MSG_FLOW_STATE' naming-typedef-id='type-id-246' filepath='include/internal/statem.h' line='48' column='1' id='type-id-247'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='MSG_FLOW_UNINITED' value='0'/>
      <enumerator name='MSG_FLOW_ERROR' value='1'/>
      <enumerator name='MSG_FLOW_READING' value='2'/>
      <enumerator name='MSG_FLOW_WRITING' value='3'/>
      <enumerator name='MSG_FLOW_FINISHED' value='4'/>
    </enum-decl>
    <typedef-decl name='MSG_FLOW_STATE' type-id='type-id-247' filepath='include/internal/statem.h' line='59' column='1' id='type-id-246'/>
    <enum-decl name='READ_STATE' naming-typedef-id='type-id-248' filepath='include/internal/statem.h' line='62' column='1' id='type-id-249'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='READ_STATE_HEADER' value='0'/>
      <enumerator name='READ_STATE_BODY' value='1'/>
      <enumerator name='READ_STATE_POST_PROCESS' value='2'/>
    </enum-decl>
    <typedef-decl name='READ_STATE' type-id='type-id-249' filepath='include/internal/statem.h' line='66' column='1' id='type-id-248'/>
    <enum-decl name='WRITE_STATE' naming-typedef-id='type-id-250' filepath='include/internal/statem.h' line='69' column='1' id='type-id-251'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='WRITE_STATE_TRANSITION' value='0'/>
      <enumerator name='WRITE_STATE_PRE_WORK' value='1'/>
      <enumerator name='WRITE_STATE_SEND' value='2'/>
      <enumerator name='WRITE_STATE_POST_WORK' value='3'/>
    </enum-decl>
    <typedef-decl name='WRITE_STATE' type-id='type-id-251' filepath='include/internal/statem.h' line='74' column='1' id='type-id-250'/>
    <typedef-decl name='ossl_statem_mutate_handshake_cb' type-id='type-id-252' filepath='include/internal/statem.h' line='82' column='1' id='type-id-253'/>
    <typedef-decl name='ossl_statem_finish_mutate_handshake_cb' type-id='type-id-254' filepath='include/internal/statem.h' line='88' column='1' id='type-id-255'/>
    <class-decl name='ossl_statem_st' size-in-bits='704' is-struct='yes' visibility='default' filepath='include/internal/statem.h' line='98' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-246' visibility='default' filepath='include/internal/statem.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='write_state' type-id='type-id-250' visibility='default' filepath='include/internal/statem.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_state_work' type-id='type-id-244' visibility='default' filepath='include/internal/statem.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='read_state' type-id='type-id-248' visibility='default' filepath='include/internal/statem.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='read_state_work' type-id='type-id-244' visibility='default' filepath='include/internal/statem.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hand_state' type-id='type-id-257' visibility='default' filepath='include/internal/statem.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='request_state' type-id='type-id-257' visibility='default' filepath='include/internal/statem.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='in_init' type-id='type-id-2' visibility='default' filepath='include/internal/statem.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read_state_first_init' type-id='type-id-2' visibility='default' filepath='include/internal/statem.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='in_handshake' type-id='type-id-2' visibility='default' filepath='include/internal/statem.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cleanuphand' type-id='type-id-2' visibility='default' filepath='include/internal/statem.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='no_cert_verify' type-id='type-id-20' visibility='default' filepath='include/internal/statem.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_timer' type-id='type-id-2' visibility='default' filepath='include/internal/statem.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mutate_handshake_cb' type-id='type-id-253' visibility='default' filepath='include/internal/statem.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='finish_mutate_handshake_cb' type-id='type-id-255' visibility='default' filepath='include/internal/statem.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mutatearg' type-id='type-id-16' visibility='default' filepath='include/internal/statem.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_in_progress' type-id='type-id-20' visibility='default' filepath='include/internal/statem.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OSSL_STATEM' type-id='type-id-256' filepath='include/internal/statem.h' line='126' column='1' id='type-id-258'/>
    <typedef-decl name='SSL_CONNECTION' type-id='type-id-259' filepath='include/internal/statem.h' line='135' column='1' id='type-id-260'/>
    <class-decl name='OSSL_TIME' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-261' visibility='default' filepath='include/internal/time.h' line='25' column='1' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='t' type-id='type-id-7' visibility='default' filepath='include/internal/time.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OSSL_TIME' type-id='type-id-262' filepath='include/internal/time.h' line='27' column='1' id='type-id-261'/>
    <typedef-decl name='ASYNC_JOB' type-id='type-id-111' filepath='include/openssl/async.h' line='38' column='1' id='type-id-263'/>
    <typedef-decl name='ASYNC_WAIT_CTX' type-id='type-id-112' filepath='include/openssl/async.h' line='39' column='1' id='type-id-264'/>
    <typedef-decl name='BIO_ADDR' type-id='type-id-200' filepath='include/openssl/bio.h' line='239' column='1' id='type-id-265'/>
    <typedef-decl name='BIO_METHOD' type-id='type-id-190' filepath='include/openssl/bio.h' line='324' column='1' id='type-id-266'/>
    <typedef-decl name='BIO_info_cb' type-id='type-id-267' filepath='include/openssl/bio.h' line='329' column='1' id='type-id-268'/>
    <class-decl name='bio_dgram_sctp_rcvinfo' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/openssl/bio.h' line='377' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rcv_sid' type-id='type-id-150' visibility='default' filepath='include/openssl/bio.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rcv_ssn' type-id='type-id-150' visibility='default' filepath='include/openssl/bio.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rcv_flags' type-id='type-id-150' visibility='default' filepath='include/openssl/bio.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rcv_ppid' type-id='type-id-19' visibility='default' filepath='include/openssl/bio.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rcv_tsn' type-id='type-id-19' visibility='default' filepath='include/openssl/bio.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rcv_cumtsn' type-id='type-id-19' visibility='default' filepath='include/openssl/bio.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rcv_context' type-id='type-id-19' visibility='default' filepath='include/openssl/bio.h' line='384' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bio_msg_st' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/openssl/bio.h' line='394' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='include/openssl/bio.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_len' type-id='type-id-8' visibility='default' filepath='include/openssl/bio.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='peer' type-id='type-id-271' visibility='default' filepath='include/openssl/bio.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='local' type-id='type-id-271' visibility='default' filepath='include/openssl/bio.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='type-id-7' visibility='default' filepath='include/openssl/bio.h' line='398' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='BIO_MSG' type-id='type-id-270' filepath='include/openssl/bio.h' line='399' column='1' id='type-id-272'/>
    <class-decl name='bio_poll_descriptor_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/bio.h' line='412' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-19' visibility='default' filepath='include/openssl/bio.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-274' visibility='default' filepath='include/openssl/bio.h' line='418' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='include/openssl/bio.h' line='414' column='1' id='type-id-274'>
      <data-member access='public'>
        <var-decl name='fd' type-id='type-id-2' visibility='default' filepath='include/openssl/bio.h' line='415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='custom' type-id='type-id-16' visibility='default' filepath='include/openssl/bio.h' line='416' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='custom_ui' type-id='type-id-182' visibility='default' filepath='include/openssl/bio.h' line='417' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='BIO_POLL_DESCRIPTOR' type-id='type-id-273' filepath='include/openssl/bio.h' line='419' column='1' id='type-id-275'/>
    <class-decl name='ossl_dispatch_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/core.h' line='40' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='function_id' type-id='type-id-2' visibility='default' filepath='include/openssl/core.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='function' type-id='type-id-277' visibility='default' filepath='include/openssl/core.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ossl_param_st' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/openssl/core.h' line='85' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-14' visibility='default' filepath='include/openssl/core.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_type' type-id='type-id-20' visibility='default' filepath='include/openssl/core.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='include/openssl/core.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data_size' type-id='type-id-8' visibility='default' filepath='include/openssl/core.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='return_size' type-id='type-id-8' visibility='default' filepath='include/openssl/core.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='CRYPTO_RWLOCK' type-id='type-id-5' filepath='include/openssl/crypto.h' line='79' column='1' id='type-id-279'/>
    <class-decl name='crypto_ex_data_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/crypto.h' line='181' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-29' visibility='default' filepath='include/openssl/crypto.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sk' type-id='type-id-281' visibility='default' filepath='include/openssl/crypto.h' line='183' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='TLS_SESSION_TICKET_EXT' type-id='type-id-282' filepath='include/openssl/ssl.h' line='232' column='1' id='type-id-283'/>
    <typedef-decl name='SSL_METHOD' type-id='type-id-284' filepath='include/openssl/ssl.h' line='233' column='1' id='type-id-285'/>
    <typedef-decl name='SSL_CIPHER' type-id='type-id-286' filepath='include/openssl/ssl.h' line='234' column='1' id='type-id-287'/>
    <typedef-decl name='SSL_SESSION' type-id='type-id-288' filepath='include/openssl/ssl.h' line='235' column='1' id='type-id-289'/>
    <typedef-decl name='SSL_COMP' type-id='type-id-290' filepath='include/openssl/ssl.h' line='238' column='1' id='type-id-291'/>
    <class-decl name='srtp_protection_profile_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/ssl.h' line='244' column='1' id='type-id-292'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='include/openssl/ssl.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-4' visibility='default' filepath='include/openssl/ssl.h' line='246' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SRTP_PROTECTION_PROFILE' type-id='type-id-292' filepath='include/openssl/ssl.h' line='247' column='1' id='type-id-293'/>
    <typedef-decl name='tls_session_ticket_ext_cb_fn' type-id='type-id-294' filepath='include/openssl/ssl.h' line='277' column='1' id='type-id-295'/>
    <typedef-decl name='tls_session_secret_cb_fn' type-id='type-id-296' filepath='include/openssl/ssl.h' line='279' column='1' id='type-id-297'/>
    <typedef-decl name='SSL_custom_ext_add_cb_ex' type-id='type-id-298' filepath='include/openssl/ssl.h' line='325' column='1' id='type-id-299'/>
    <typedef-decl name='SSL_custom_ext_free_cb_ex' type-id='type-id-300' filepath='include/openssl/ssl.h' line='332' column='1' id='type-id-301'/>
    <typedef-decl name='SSL_custom_ext_parse_cb_ex' type-id='type-id-302' filepath='include/openssl/ssl.h' line='337' column='1' id='type-id-303'/>
    <typedef-decl name='SSL_async_callback_fn' type-id='type-id-304' filepath='include/openssl/ssl.h' line='348' column='1' id='type-id-305'/>
    <typedef-decl name='GEN_SESSION_CB' type-id='type-id-306' filepath='include/openssl/ssl.h' line='703' column='1' id='type-id-307'/>
    <typedef-decl name='SSL_CTX_npn_advertised_cb_func' type-id='type-id-308' filepath='include/openssl/ssl.h' line='801' column='1' id='type-id-309'/>
    <typedef-decl name='SSL_CTX_npn_select_cb_func' type-id='type-id-310' filepath='include/openssl/ssl.h' line='810' column='1' id='type-id-311'/>
    <typedef-decl name='SSL_psk_client_cb_func' type-id='type-id-312' filepath='include/openssl/ssl.h' line='858' column='1' id='type-id-313'/>
    <typedef-decl name='SSL_psk_server_cb_func' type-id='type-id-314' filepath='include/openssl/ssl.h' line='867' column='1' id='type-id-315'/>
    <typedef-decl name='SSL_psk_find_session_cb_func' type-id='type-id-316' filepath='include/openssl/ssl.h' line='880' column='1' id='type-id-317'/>
    <typedef-decl name='SSL_psk_use_session_cb_func' type-id='type-id-318' filepath='include/openssl/ssl.h' line='884' column='1' id='type-id-319'/>
    <typedef-decl name='SSL_CTX_keylog_cb_func' type-id='type-id-320' filepath='include/openssl/ssl.h' line='955' column='1' id='type-id-321'/>
    <enum-decl name='OSSL_HANDSHAKE_STATE' naming-typedef-id='type-id-257' filepath='include/openssl/ssl.h' line='1084' column='1' id='type-id-322'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='TLS_ST_BEFORE' value='0'/>
      <enumerator name='TLS_ST_OK' value='1'/>
      <enumerator name='DTLS_ST_CR_HELLO_VERIFY_REQUEST' value='2'/>
      <enumerator name='TLS_ST_CR_SRVR_HELLO' value='3'/>
      <enumerator name='TLS_ST_CR_CERT' value='4'/>
      <enumerator name='TLS_ST_CR_COMP_CERT' value='5'/>
      <enumerator name='TLS_ST_CR_CERT_STATUS' value='6'/>
      <enumerator name='TLS_ST_CR_KEY_EXCH' value='7'/>
      <enumerator name='TLS_ST_CR_CERT_REQ' value='8'/>
      <enumerator name='TLS_ST_CR_SRVR_DONE' value='9'/>
      <enumerator name='TLS_ST_CR_SESSION_TICKET' value='10'/>
      <enumerator name='TLS_ST_CR_CHANGE' value='11'/>
      <enumerator name='TLS_ST_CR_FINISHED' value='12'/>
      <enumerator name='TLS_ST_CW_CLNT_HELLO' value='13'/>
      <enumerator name='TLS_ST_CW_CERT' value='14'/>
      <enumerator name='TLS_ST_CW_COMP_CERT' value='15'/>
      <enumerator name='TLS_ST_CW_KEY_EXCH' value='16'/>
      <enumerator name='TLS_ST_CW_CERT_VRFY' value='17'/>
      <enumerator name='TLS_ST_CW_CHANGE' value='18'/>
      <enumerator name='TLS_ST_CW_NEXT_PROTO' value='19'/>
      <enumerator name='TLS_ST_CW_FINISHED' value='20'/>
      <enumerator name='TLS_ST_SW_HELLO_REQ' value='21'/>
      <enumerator name='TLS_ST_SR_CLNT_HELLO' value='22'/>
      <enumerator name='DTLS_ST_SW_HELLO_VERIFY_REQUEST' value='23'/>
      <enumerator name='TLS_ST_SW_SRVR_HELLO' value='24'/>
      <enumerator name='TLS_ST_SW_CERT' value='25'/>
      <enumerator name='TLS_ST_SW_COMP_CERT' value='26'/>
      <enumerator name='TLS_ST_SW_KEY_EXCH' value='27'/>
      <enumerator name='TLS_ST_SW_CERT_REQ' value='28'/>
      <enumerator name='TLS_ST_SW_SRVR_DONE' value='29'/>
      <enumerator name='TLS_ST_SR_CERT' value='30'/>
      <enumerator name='TLS_ST_SR_COMP_CERT' value='31'/>
      <enumerator name='TLS_ST_SR_KEY_EXCH' value='32'/>
      <enumerator name='TLS_ST_SR_CERT_VRFY' value='33'/>
      <enumerator name='TLS_ST_SR_NEXT_PROTO' value='34'/>
      <enumerator name='TLS_ST_SR_CHANGE' value='35'/>
      <enumerator name='TLS_ST_SR_FINISHED' value='36'/>
      <enumerator name='TLS_ST_SW_SESSION_TICKET' value='37'/>
      <enumerator name='TLS_ST_SW_CERT_STATUS' value='38'/>
      <enumerator name='TLS_ST_SW_CHANGE' value='39'/>
      <enumerator name='TLS_ST_SW_FINISHED' value='40'/>
      <enumerator name='TLS_ST_SW_ENCRYPTED_EXTENSIONS' value='41'/>
      <enumerator name='TLS_ST_CR_ENCRYPTED_EXTENSIONS' value='42'/>
      <enumerator name='TLS_ST_CR_CERT_VRFY' value='43'/>
      <enumerator name='TLS_ST_SW_CERT_VRFY' value='44'/>
      <enumerator name='TLS_ST_CR_HELLO_REQ' value='45'/>
      <enumerator name='TLS_ST_SW_KEY_UPDATE' value='46'/>
      <enumerator name='TLS_ST_CW_KEY_UPDATE' value='47'/>
      <enumerator name='TLS_ST_SR_KEY_UPDATE' value='48'/>
      <enumerator name='TLS_ST_CR_KEY_UPDATE' value='49'/>
      <enumerator name='TLS_ST_EARLY_DATA' value='50'/>
      <enumerator name='TLS_ST_PENDING_EARLY_DATA_END' value='51'/>
      <enumerator name='TLS_ST_CW_END_OF_EARLY_DATA' value='52'/>
      <enumerator name='TLS_ST_SR_END_OF_EARLY_DATA' value='53'/>
    </enum-decl>
    <typedef-decl name='OSSL_HANDSHAKE_STATE' type-id='type-id-322' filepath='include/openssl/ssl.h' line='1139' column='1' id='type-id-257'/>
    <typedef-decl name='SSL_client_hello_cb_fn' type-id='type-id-323' filepath='include/openssl/ssl.h' line='1958' column='1' id='type-id-324'/>
    <typedef-decl name='ssl_ct_validation_cb' type-id='type-id-325' filepath='include/openssl/ssl.h' line='2476' column='1' id='type-id-326'/>
    <typedef-decl name='SSL_TICKET_STATUS' type-id='type-id-2' filepath='include/openssl/ssl.h' line='2670' column='1' id='type-id-327'/>
    <typedef-decl name='SSL_TICKET_RETURN' type-id='type-id-2' filepath='include/openssl/ssl.h' line='2689' column='1' id='type-id-328'/>
    <typedef-decl name='SSL_CTX_generate_session_ticket_fn' type-id='type-id-304' filepath='include/openssl/ssl.h' line='2702' column='1' id='type-id-329'/>
    <typedef-decl name='SSL_CTX_decrypt_session_ticket_fn' type-id='type-id-330' filepath='include/openssl/ssl.h' line='2703' column='1' id='type-id-331'/>
    <typedef-decl name='DTLS_timer_cb' type-id='type-id-332' filepath='include/openssl/ssl.h' line='2715' column='1' id='type-id-333'/>
    <typedef-decl name='SSL_allow_early_data_cb_fn' type-id='type-id-304' filepath='include/openssl/ssl.h' line='2720' column='1' id='type-id-334'/>
    <class-decl name='tls_session_ticket_ext_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/openssl/tls1.h' line='1202' column='1' id='type-id-282'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-173' visibility='default' filepath='include/openssl/tls1.h' line='1203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='include/openssl/tls1.h' line='1204' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='BIO' type-id='type-id-114' filepath='include/openssl/types.h' line='89' column='1' id='type-id-335'/>
    <typedef-decl name='BIGNUM' type-id='type-id-113' filepath='include/openssl/types.h' line='90' column='1' id='type-id-336'/>
    <typedef-decl name='EVP_CIPHER' type-id='type-id-121' filepath='include/openssl/types.h' line='104' column='1' id='type-id-337'/>
    <typedef-decl name='EVP_CIPHER_CTX' type-id='type-id-120' filepath='include/openssl/types.h' line='105' column='1' id='type-id-338'/>
    <typedef-decl name='EVP_MD' type-id='type-id-124' filepath='include/openssl/types.h' line='106' column='1' id='type-id-339'/>
    <typedef-decl name='EVP_MD_CTX' type-id='type-id-123' filepath='include/openssl/types.h' line='107' column='1' id='type-id-340'/>
    <typedef-decl name='EVP_MAC_CTX' type-id='type-id-122' filepath='include/openssl/types.h' line='109' column='1' id='type-id-341'/>
    <typedef-decl name='EVP_PKEY' type-id='type-id-125' filepath='include/openssl/types.h' line='110' column='1' id='type-id-342'/>
    <typedef-decl name='HMAC_CTX' type-id='type-id-126' filepath='include/openssl/types.h' line='135' column='1' id='type-id-343'/>
    <typedef-decl name='DH' type-id='type-id-118' filepath='include/openssl/types.h' line='137' column='1' id='type-id-344'/>
    <typedef-decl name='SSL_DANE' type-id='type-id-207' filepath='include/openssl/types.h' line='159' column='1' id='type-id-345'/>
    <typedef-decl name='X509' type-id='type-id-139' filepath='include/openssl/types.h' line='160' column='1' id='type-id-346'/>
    <typedef-decl name='X509_STORE' type-id='type-id-141' filepath='include/openssl/types.h' line='167' column='1' id='type-id-347'/>
    <typedef-decl name='X509_STORE_CTX' type-id='type-id-140' filepath='include/openssl/types.h' line='168' column='1' id='type-id-348'/>
    <typedef-decl name='X509_VERIFY_PARAM' type-id='type-id-110' filepath='include/openssl/types.h' line='173' column='1' id='type-id-349'/>
    <typedef-decl name='ENGINE' type-id='type-id-119' filepath='include/openssl/types.h' line='186' column='1' id='type-id-350'/>
    <typedef-decl name='SSL' type-id='type-id-351' filepath='include/openssl/types.h' line='187' column='1' id='type-id-352'/>
    <typedef-decl name='SSL_CTX' type-id='type-id-353' filepath='include/openssl/types.h' line='188' column='1' id='type-id-354'/>
    <typedef-decl name='COMP_METHOD' type-id='type-id-115' filepath='include/openssl/types.h' line='191' column='1' id='type-id-355'/>
    <typedef-decl name='CRYPTO_EX_DATA' type-id='type-id-280' filepath='include/openssl/types.h' line='203' column='1' id='type-id-356'/>
    <typedef-decl name='CTLOG_STORE' type-id='type-id-117' filepath='include/openssl/types.h' line='212' column='1' id='type-id-357'/>
    <typedef-decl name='CT_POLICY_EVAL_CTX' type-id='type-id-116' filepath='include/openssl/types.h' line='213' column='1' id='type-id-358'/>
    <typedef-decl name='OSSL_DISPATCH' type-id='type-id-276' filepath='include/openssl/types.h' line='220' column='1' id='type-id-359'/>
    <typedef-decl name='OSSL_PARAM' type-id='type-id-278' filepath='include/openssl/types.h' line='223' column='1' id='type-id-360'/>
    <typedef-decl name='pem_password_cb' type-id='type-id-361' filepath='include/openssl/types.h' line='226' column='1' id='type-id-362'/>
    <typedef-decl name='X509_EXTENSIONS' type-id='type-id-135' filepath='include/openssl/x509.h' line='253' column='1' id='type-id-363'/>
    <class-decl name='tls_record_st' size-in-bits='704' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='22' column='1' id='type-id-364'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rechandle' type-id='type-id-16' visibility='default' filepath='ssl/record/record.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version' type-id='type-id-2' visibility='default' filepath='ssl/record/record.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='type-id-154' visibility='default' filepath='ssl/record/record.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-215' visibility='default' filepath='ssl/record/record.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allocdata' type-id='type-id-15' visibility='default' filepath='ssl/record/record.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='length' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='off' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='epoch' type-id='type-id-150' visibility='default' filepath='ssl/record/record.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='seq_num' type-id='type-id-172' visibility='default' filepath='ssl/record/record.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='recordinfo' type-id='type-id-269' visibility='default' filepath='ssl/record/record.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='TLS_RECORD' type-id='type-id-364' filepath='ssl/record/record.h' line='44' column='1' id='type-id-103'/>
    <class-decl name='record_pqueue_st' size-in-bits='128' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='46' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-150' visibility='default' filepath='ssl/record/record.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='q' type-id='type-id-366' visibility='default' filepath='ssl/record/record.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='record_pqueue' type-id='type-id-365' filepath='ssl/record/record.h' line='49' column='1' id='type-id-367'/>
    <class-decl name='dtls_record_layer_st' size-in-bits='192' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='51' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r_epoch' type-id='type-id-150' visibility='default' filepath='ssl/record/record.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='w_epoch' type-id='type-id-150' visibility='default' filepath='ssl/record/record.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffered_app_data' type-id='type-id-367' visibility='default' filepath='ssl/record/record.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DTLS_RECORD_LAYER' type-id='type-id-368' filepath='ssl/record/record.h' line='66' column='1' id='type-id-369'/>
    <class-decl name='record_layer_st' size-in-bits='24064' is-struct='yes' visibility='default' filepath='ssl/record/record.h' line='76' column='1' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-371' visibility='default' filepath='ssl/record/record.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='custom_rlmethod' type-id='type-id-372' visibility='default' filepath='ssl/record/record.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rlarg' type-id='type-id-16' visibility='default' filepath='ssl/record/record.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rrlmethod' type-id='type-id-372' visibility='default' filepath='ssl/record/record.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='wrlmethod' type-id='type-id-372' visibility='default' filepath='ssl/record/record.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rrl' type-id='type-id-373' visibility='default' filepath='ssl/record/record.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='wrl' type-id='type-id-373' visibility='default' filepath='ssl/record/record.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rrlnext' type-id='type-id-374' visibility='default' filepath='ssl/record/record.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='default_read_buf_len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='read_ahead' type-id='type-id-2' visibility='default' filepath='ssl/record/record.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='wnum' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='handshake_fragment' type-id='type-id-167' visibility='default' filepath='ssl/record/record.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='handshake_fragment_len' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='wpend_tot' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='wpend_type' type-id='type-id-154' visibility='default' filepath='ssl/record/record.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='wpend_ret' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='wpend_buf' type-id='type-id-215' visibility='default' filepath='ssl/record/record.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='alert_count' type-id='type-id-20' visibility='default' filepath='ssl/record/record.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='d' type-id='type-id-375' visibility='default' filepath='ssl/record/record.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='record_padding_cb' type-id='type-id-376' visibility='default' filepath='ssl/record/record.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='record_padding_arg' type-id='type-id-16' visibility='default' filepath='ssl/record/record.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='block_padding' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='num_recs' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='curr_rec' type-id='type-id-8' visibility='default' filepath='ssl/record/record.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tlsrecs' type-id='type-id-104' visibility='default' filepath='ssl/record/record.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='RECORD_LAYER' type-id='type-id-370' filepath='ssl/record/record.h' line='131' column='1' id='type-id-377'/>
    <enum-decl name='SSL_PHA_STATE' naming-typedef-id='type-id-378' filepath='ssl/ssl_local.h' line='386' column='1' id='type-id-379'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='SSL_PHA_NONE' value='0'/>
      <enumerator name='SSL_PHA_EXT_SENT' value='1'/>
      <enumerator name='SSL_PHA_EXT_RECEIVED' value='2'/>
      <enumerator name='SSL_PHA_REQUEST_PENDING' value='3'/>
      <enumerator name='SSL_PHA_REQUESTED' value='4'/>
    </enum-decl>
    <typedef-decl name='SSL_PHA_STATE' type-id='type-id-379' filepath='ssl/ssl_local.h' line='392' column='1' id='type-id-378'/>
    <class-decl name='ssl_cipher_st' size-in-bits='640' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='397' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='valid' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stdname' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='algorithm_mkey' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='algorithm_auth' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='algorithm_enc' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='algorithm_mac' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='min_tls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_tls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='min_dtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_dtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='algo_strength' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='algorithm2' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='strength_bits' type-id='type-id-185' visibility='default' filepath='ssl/ssl_local.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='alg_bits' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='417' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_method_st' size-in-bits='1984' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='421' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mask' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ssl_new' type-id='type-id-380' visibility='default' filepath='ssl/ssl_local.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ssl_free' type-id='type-id-381' visibility='default' filepath='ssl/ssl_local.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ssl_reset' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ssl_init' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ssl_clear' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ssl_deinit' type-id='type-id-381' visibility='default' filepath='ssl/ssl_local.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ssl_accept' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ssl_connect' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ssl_read' type-id='type-id-383' visibility='default' filepath='ssl/ssl_local.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ssl_peek' type-id='type-id-383' visibility='default' filepath='ssl/ssl_local.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ssl_write' type-id='type-id-383' visibility='default' filepath='ssl/ssl_local.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ssl_shutdown' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ssl_renegotiate' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ssl_renegotiate_check' type-id='type-id-384' visibility='default' filepath='ssl/ssl_local.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ssl_read_bytes' type-id='type-id-385' visibility='default' filepath='ssl/ssl_local.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ssl_write_bytes' type-id='type-id-386' visibility='default' filepath='ssl/ssl_local.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ssl_dispatch_alert' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ssl_ctrl' type-id='type-id-387' visibility='default' filepath='ssl/ssl_local.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ssl_ctx_ctrl' type-id='type-id-388' visibility='default' filepath='ssl/ssl_local.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='get_cipher_by_char' type-id='type-id-389' visibility='default' filepath='ssl/ssl_local.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='put_cipher_by_char' type-id='type-id-390' visibility='default' filepath='ssl/ssl_local.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ssl_pending' type-id='type-id-391' visibility='default' filepath='ssl/ssl_local.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='num_ciphers' type-id='type-id-392' visibility='default' filepath='ssl/ssl_local.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='get_cipher' type-id='type-id-393' visibility='default' filepath='ssl/ssl_local.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='get_timeout' type-id='type-id-394' visibility='default' filepath='ssl/ssl_local.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='ssl3_enc' type-id='type-id-395' visibility='default' filepath='ssl/ssl_local.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ssl_version' type-id='type-id-392' visibility='default' filepath='ssl/ssl_local.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ssl_callback_ctrl' type-id='type-id-396' visibility='default' filepath='ssl/ssl_local.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='ssl_ctx_callback_ctrl' type-id='type-id-397' visibility='default' filepath='ssl/ssl_local.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_session_st' size-in-bits='7424' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='492' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ssl_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='master_key_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='early_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='master_key' type-id='type-id-168' visibility='default' filepath='ssl/ssl_local.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='session_id_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='session_id' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='sid_ctx' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='psk_identity_hint' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='psk_identity' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='not_resumable' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='peer_rpk' type-id='type-id-202' visibility='default' filepath='ssl/ssl_local.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='peer' type-id='type-id-212' visibility='default' filepath='ssl/ssl_local.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='peer_chain' type-id='type-id-210' visibility='default' filepath='ssl/ssl_local.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='verify_result' type-id='type-id-59' visibility='default' filepath='ssl/ssl_local.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='references' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='timeout' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='time' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='calc_timeout' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='compress_meth' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='cipher' type-id='type-id-398' visibility='default' filepath='ssl/ssl_local.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='cipher_id' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='kex_group' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ex_data' type-id='type-id-356' visibility='default' filepath='ssl/ssl_local.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='prev' type-id='type-id-399' visibility='default' filepath='ssl/ssl_local.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='next' type-id='type-id-399' visibility='default' filepath='ssl/ssl_local.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='ext' type-id='type-id-400' visibility='default' filepath='ssl/ssl_local.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='srp_username' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='ticket_appdata' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='ticket_appdata_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='flags' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='owner' type-id='type-id-401' visibility='default' filepath='ssl/ssl_local.h' line='578' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='551' column='1' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostname' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tick' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ticklen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tick_lifetime_hint' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tick_age_add' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_early_data' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='alpn_selected' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='alpn_selected_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='srp_ctx_st' size-in-bits='1024' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='586' column='1' id='type-id-402'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='SRP_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='TLS_ext_srp_username_callback' type-id='type-id-323' visibility='default' filepath='ssl/ssl_local.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='SRP_verify_param_callback' type-id='type-id-304' visibility='default' filepath='ssl/ssl_local.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='SRP_give_srp_client_pwd_callback' type-id='type-id-403' visibility='default' filepath='ssl/ssl_local.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='login' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='N' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='g' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='s' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='B' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='A' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='a' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='b' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='v' type-id='type-id-404' visibility='default' filepath='ssl/ssl_local.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='info' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='strength' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='srp_Mask' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='600' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SRP_CTX' type-id='type-id-402' filepath='ssl/ssl_local.h' line='601' column='1' id='type-id-405'/>
    <enum-decl name='SSL_EARLY_DATA_STATE' naming-typedef-id='type-id-406' filepath='ssl/ssl_local.h' line='605' column='1' id='type-id-407'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='SSL_EARLY_DATA_NONE' value='0'/>
      <enumerator name='SSL_EARLY_DATA_CONNECT_RETRY' value='1'/>
      <enumerator name='SSL_EARLY_DATA_CONNECTING' value='2'/>
      <enumerator name='SSL_EARLY_DATA_WRITE_RETRY' value='3'/>
      <enumerator name='SSL_EARLY_DATA_WRITING' value='4'/>
      <enumerator name='SSL_EARLY_DATA_WRITE_FLUSH' value='5'/>
      <enumerator name='SSL_EARLY_DATA_UNAUTH_WRITING' value='6'/>
      <enumerator name='SSL_EARLY_DATA_FINISHED_WRITING' value='7'/>
      <enumerator name='SSL_EARLY_DATA_ACCEPT_RETRY' value='8'/>
      <enumerator name='SSL_EARLY_DATA_ACCEPTING' value='9'/>
      <enumerator name='SSL_EARLY_DATA_READ_RETRY' value='10'/>
      <enumerator name='SSL_EARLY_DATA_READING' value='11'/>
      <enumerator name='SSL_EARLY_DATA_FINISHED_READING' value='12'/>
    </enum-decl>
    <typedef-decl name='SSL_EARLY_DATA_STATE' type-id='type-id-407' filepath='ssl/ssl_local.h' line='619' column='1' id='type-id-406'/>
    <class-decl name='ssl_comp_st' size-in-bits='192' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='643' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='method' type-id='type-id-408' visibility='default' filepath='ssl/ssl_local.h' line='646' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='raw_extension_st' size-in-bits='320' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='649' column='1' id='type-id-409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-213' visibility='default' filepath='ssl/ssl_local.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='present' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='parsed' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='received_order' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='659' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='RAW_EXTENSION' type-id='type-id-409' filepath='ssl/ssl_local.h' line='660' column='1' id='type-id-410'/>
    <class-decl name='CLIENTHELLO_MSG' size-in-bits='5248' is-struct='yes' naming-typedef-id='type-id-411' visibility='default' filepath='ssl/ssl_local.h' line='662' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='isv2' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='legacy_version' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='random' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='session_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='session_id' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dtls_cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dtls_cookie' type-id='type-id-163' visibility='default' filepath='ssl/ssl_local.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='ciphersuites' type-id='type-id-213' visibility='default' filepath='ssl/ssl_local.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='compressions_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='compressions' type-id='type-id-163' visibility='default' filepath='ssl/ssl_local.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='extensions' type-id='type-id-213' visibility='default' filepath='ssl/ssl_local.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='pre_proc_exts_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='pre_proc_exts' type-id='type-id-413' visibility='default' filepath='ssl/ssl_local.h' line='675' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='CLIENTHELLO_MSG' type-id='type-id-412' filepath='ssl/ssl_local.h' line='676' column='1' id='type-id-411'/>
    <class-decl name='lhash_st_SSL_SESSION' size-in-bits='64' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-415' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='lh_SSL_SESSION_dummy' size-in-bits='64' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1' id='type-id-415'>
      <data-member access='public'>
        <var-decl name='d1' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d2' type-id='type-id-4' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d3' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='716' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='ssl_ctx_ext_secure_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='723' column='1' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tick_hmac_key' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tick_aes_key' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SSL_CTX_EXT_SECURE' type-id='type-id-416' filepath='ssl/ssl_local.h' line='726' column='1' id='type-id-417'/>
    <class-decl name='tls_group_info_st' size-in-bits='448' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='759' column='1' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tlsname' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='realname' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='algorithm' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secbits' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='group_id' type-id='type-id-150' visibility='default' filepath='ssl/ssl_local.h' line='764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mintls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='maxtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mindtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='maxdtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='is_kem' type-id='type-id-1' visibility='default' filepath='ssl/ssl_local.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='TLS_GROUP_INFO' type-id='type-id-418' filepath='ssl/ssl_local.h' line='770' column='1' id='type-id-419'/>
    <class-decl name='tls_sigalg_info_st' size-in-bits='768' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='772' column='1' id='type-id-420'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='code_point' type-id='type-id-150' visibility='default' filepath='ssl/ssl_local.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sigalg_name' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sigalg_oid' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sig_name' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sig_oid' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='hash_name' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hash_oid' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='keytype' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='keytype_oid' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='secbits' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='mintls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='784' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='maxtls' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='785' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='TLS_SIGALG_INFO' type-id='type-id-420' filepath='ssl/ssl_local.h' line='786' column='1' id='type-id-421'/>
    <class-decl name='SSL_CERT_LOOKUP' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-422' visibility='default' filepath='ssl/ssl_local.h' line='792' column='1' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nid' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='amask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='794' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SSL_CERT_LOOKUP' type-id='type-id-423' filepath='ssl/ssl_local.h' line='795' column='1' id='type-id-422'/>
    <class-decl name='ssl_ctx_st' size-in-bits='13696' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='807' column='1' id='type-id-353'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='libctx' type-id='type-id-29' visibility='default' filepath='ssl/ssl_local.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='method' type-id='type-id-424' visibility='default' filepath='ssl/ssl_local.h' line='810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cipher_list' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cipher_list_by_id' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tls13_ciphersuites' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cert_store' type-id='type-id-426' visibility='default' filepath='ssl/ssl_local.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sessions' type-id='type-id-427' visibility='default' filepath='ssl/ssl_local.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='session_cache_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='session_cache_head' type-id='type-id-399' visibility='default' filepath='ssl/ssl_local.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='session_cache_tail' type-id='type-id-399' visibility='default' filepath='ssl/ssl_local.h' line='824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='session_cache_mode' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='session_timeout' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='new_session_cb' type-id='type-id-428' visibility='default' filepath='ssl/ssl_local.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='remove_session_cb' type-id='type-id-429' visibility='default' filepath='ssl/ssl_local.h' line='847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='get_session_cb' type-id='type-id-430' visibility='default' filepath='ssl/ssl_local.h' line='848' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='stats' type-id='type-id-431' visibility='default' filepath='ssl/ssl_local.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='references' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='app_verify_callback' type-id='type-id-432' visibility='default' filepath='ssl/ssl_local.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='app_verify_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='878' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='default_passwd_callback' type-id='type-id-433' visibility='default' filepath='ssl/ssl_local.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='default_passwd_callback_userdata' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='client_cert_cb' type-id='type-id-434' visibility='default' filepath='ssl/ssl_local.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='app_gen_cookie_cb' type-id='type-id-306' visibility='default' filepath='ssl/ssl_local.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='app_verify_cookie_cb' type-id='type-id-435' visibility='default' filepath='ssl/ssl_local.h' line='898' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='gen_stateless_cookie_cb' type-id='type-id-436' visibility='default' filepath='ssl/ssl_local.h' line='902' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='verify_stateless_cookie_cb' type-id='type-id-437' visibility='default' filepath='ssl/ssl_local.h' line='906' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='ex_data' type-id='type-id-356' visibility='default' filepath='ssl/ssl_local.h' line='909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='md5' type-id='type-id-145' visibility='default' filepath='ssl/ssl_local.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='sha1' type-id='type-id-145' visibility='default' filepath='ssl/ssl_local.h' line='912' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='extra_certs' type-id='type-id-210' visibility='default' filepath='ssl/ssl_local.h' line='914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='comp_methods' type-id='type-id-438' visibility='default' filepath='ssl/ssl_local.h' line='915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='info_callback' type-id='type-id-439' visibility='default' filepath='ssl/ssl_local.h' line='920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='ca_names' type-id='type-id-440' visibility='default' filepath='ssl/ssl_local.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='client_ca_names' type-id='type-id-440' visibility='default' filepath='ssl/ssl_local.h' line='929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='options' type-id='type-id-7' visibility='default' filepath='ssl/ssl_local.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='mode' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='min_proto_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='max_proto_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='max_cert_list' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='cert' type-id='type-id-441' visibility='default' filepath='ssl/ssl_local.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ssl_cert_info' type-id='type-id-442' visibility='default' filepath='ssl/ssl_local.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='read_ahead' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='msg_callback' type-id='type-id-243' visibility='default' filepath='ssl/ssl_local.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='msg_callback_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='verify_mode' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='sid_ctx' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='default_verify_callback' type-id='type-id-443' visibility='default' filepath='ssl/ssl_local.h' line='954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='generate_session_id' type-id='type-id-307' visibility='default' filepath='ssl/ssl_local.h' line='957' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='param' type-id='type-id-444' visibility='default' filepath='ssl/ssl_local.h' line='959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='quiet_shutdown' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='ctlog_store' type-id='type-id-445' visibility='default' filepath='ssl/ssl_local.h' line='964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='ct_validation_callback' type-id='type-id-326' visibility='default' filepath='ssl/ssl_local.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='ct_validation_callback_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='split_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='max_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='max_pipelines' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='default_read_buf_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='client_cert_engine' type-id='type-id-446' visibility='default' filepath='ssl/ssl_local.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='client_hello_cb' type-id='type-id-324' visibility='default' filepath='ssl/ssl_local.h' line='998' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='client_hello_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='ext' type-id='type-id-447' visibility='default' filepath='ssl/ssl_local.h' line='1085' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='psk_client_callback' type-id='type-id-313' visibility='default' filepath='ssl/ssl_local.h' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='psk_server_callback' type-id='type-id-315' visibility='default' filepath='ssl/ssl_local.h' line='1089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='psk_find_session_cb' type-id='type-id-317' visibility='default' filepath='ssl/ssl_local.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='psk_use_session_cb' type-id='type-id-319' visibility='default' filepath='ssl/ssl_local.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='srp_ctx' type-id='type-id-405' visibility='default' filepath='ssl/ssl_local.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='dane' type-id='type-id-204' visibility='default' filepath='ssl/ssl_local.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='srtp_profiles' type-id='type-id-448' visibility='default' filepath='ssl/ssl_local.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='not_resumable_session_cb' type-id='type-id-384' visibility='default' filepath='ssl/ssl_local.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='lock' type-id='type-id-449' visibility='default' filepath='ssl/ssl_local.h' line='1111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='keylog_callback' type-id='type-id-321' visibility='default' filepath='ssl/ssl_local.h' line='1117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='max_early_data' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7968'>
        <var-decl name='recv_max_early_data' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='record_padding_cb' type-id='type-id-376' visibility='default' filepath='ssl/ssl_local.h' line='1132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='record_padding_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='block_padding' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='generate_ticket_cb' type-id='type-id-329' visibility='default' filepath='ssl/ssl_local.h' line='1137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='decrypt_ticket_cb' type-id='type-id-331' visibility='default' filepath='ssl/ssl_local.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='ticket_cb_data' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='num_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='allow_early_data_cb' type-id='type-id-334' visibility='default' filepath='ssl/ssl_local.h' line='1145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='allow_early_data_cb_data' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='pha_enabled' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='async_cb' type-id='type-id-305' visibility='default' filepath='ssl/ssl_local.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='async_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='propq' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='1155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='ssl_mac_pkey_id' type-id='type-id-147' visibility='default' filepath='ssl/ssl_local.h' line='1157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='ssl_cipher_methods' type-id='type-id-143' visibility='default' filepath='ssl/ssl_local.h' line='1158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='ssl_digest_methods' type-id='type-id-146' visibility='default' filepath='ssl/ssl_local.h' line='1159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11712'>
        <var-decl name='ssl_mac_secret_size' type-id='type-id-149' visibility='default' filepath='ssl/ssl_local.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='tls12_sigalgs_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12672'>
        <var-decl name='sigalg_lookup_cache' type-id='type-id-450' visibility='default' filepath='ssl/ssl_local.h' line='1164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12736'>
        <var-decl name='tls12_sigalgs' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12800'>
        <var-decl name='group_list' type-id='type-id-452' visibility='default' filepath='ssl/ssl_local.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='group_list_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12928'>
        <var-decl name='group_list_max_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12992'>
        <var-decl name='sigalg_list' type-id='type-id-453' visibility='default' filepath='ssl/ssl_local.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13056'>
        <var-decl name='sigalg_list_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='sigalg_list_max_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13184'>
        <var-decl name='disabled_enc_mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13216'>
        <var-decl name='disabled_mac_mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13248'>
        <var-decl name='disabled_mkey_mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13280'>
        <var-decl name='disabled_auth_mask' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13312'>
        <var-decl name='cert_comp_prefs' type-id='type-id-148' visibility='default' filepath='ssl/ssl_local.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13440'>
        <var-decl name='client_cert_type' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13504'>
        <var-decl name='client_cert_type_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='server_cert_type' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='server_cert_type_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1191' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='352' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='851' column='1' id='type-id-431'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='1792' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1002' column='1' id='type-id-447'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='servername_cb' type-id='type-id-323' visibility='default' filepath='ssl/ssl_local.h' line='1004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='servername_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tick_key_name' type-id='type-id-162' visibility='default' filepath='ssl/ssl_local.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='secure' type-id='type-id-454' visibility='default' filepath='ssl/ssl_local.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ticket_key_cb' type-id='type-id-455' visibility='default' filepath='ssl/ssl_local.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ticket_key_evp_cb' type-id='type-id-456' visibility='default' filepath='ssl/ssl_local.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='status_cb' type-id='type-id-304' visibility='default' filepath='ssl/ssl_local.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='status_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1023' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='status_type' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1030' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ecpointformats' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='supportedgroups' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1034' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='supported_groups_default' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1036' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='supported_groups_default_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='alpn_select_cb' type-id='type-id-457' visibility='default' filepath='ssl/ssl_local.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='alpn_select_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='alpn' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='alpn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='npn_advertised_cb' type-id='type-id-309' visibility='default' filepath='ssl/ssl_local.h' line='1074' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='npn_advertised_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='npn_select_cb' type-id='type-id-311' visibility='default' filepath='ssl/ssl_local.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='npn_select_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='cookie_hmac_key' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='1084' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='CERT_PKEY' type-id='type-id-458' filepath='ssl/ssl_local.h' line='1194' column='1' id='type-id-459'/>
    <class-decl name='ssl_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1200' column='1' id='type-id-351'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-401' visibility='default' filepath='ssl/ssl_local.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='defltmeth' type-id='type-id-424' visibility='default' filepath='ssl/ssl_local.h' line='1203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='method' type-id='type-id-424' visibility='default' filepath='ssl/ssl_local.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='references' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lock' type-id='type-id-449' visibility='default' filepath='ssl/ssl_local.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ex_data' type-id='type-id-356' visibility='default' filepath='ssl/ssl_local.h' line='1208' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl_connection_st' size-in-bits='49472' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1211' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ssl' type-id='type-id-351' visibility='default' filepath='ssl/ssl_local.h' line='1213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rbio' type-id='type-id-374' visibility='default' filepath='ssl/ssl_local.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='wbio' type-id='type-id-374' visibility='default' filepath='ssl/ssl_local.h' line='1226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bbio' type-id='type-id-374' visibility='default' filepath='ssl/ssl_local.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rwstate' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_func' type-id='type-id-382' visibility='default' filepath='ssl/ssl_local.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='server' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='new_session' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='quiet_shutdown' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='shutdown' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ts_msg_write' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ts_msg_read' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='statem' type-id='type-id-258' visibility='default' filepath='ssl/ssl_local.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='early_data_state' type-id='type-id-406' visibility='default' filepath='ssl/ssl_local.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='init_buf' type-id='type-id-12' visibility='default' filepath='ssl/ssl_local.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='init_msg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='init_num' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='init_off' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='ssl_pkey_num' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='s3' type-id='type-id-460' visibility='default' filepath='ssl/ssl_local.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='d1' type-id='type-id-461' visibility='default' filepath='ssl/ssl_local.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='msg_callback' type-id='type-id-242' visibility='default' filepath='ssl/ssl_local.h' line='1439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='msg_callback_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='hit' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='param' type-id='type-id-444' visibility='default' filepath='ssl/ssl_local.h' line='1443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='dane' type-id='type-id-345' visibility='default' filepath='ssl/ssl_local.h' line='1445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='peer_ciphers' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='1447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='cipher_list' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='1448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='cipher_list_by_id' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='tls13_ciphersuites' type-id='type-id-425' visibility='default' filepath='ssl/ssl_local.h' line='1451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='mac_flags' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10208'>
        <var-decl name='early_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10720'>
        <var-decl name='handshake_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11232'>
        <var-decl name='master_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11744'>
        <var-decl name='resumption_master_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1463' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12256'>
        <var-decl name='client_finished_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12768'>
        <var-decl name='server_finished_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13280'>
        <var-decl name='server_finished_hash' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13792'>
        <var-decl name='handshake_traffic_hash' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14304'>
        <var-decl name='client_app_traffic_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14816'>
        <var-decl name='server_app_traffic_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15328'>
        <var-decl name='exporter_master_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15840'>
        <var-decl name='early_exporter_master_secret' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='cert' type-id='type-id-441' visibility='default' filepath='ssl/ssl_local.h' line='1476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16448'>
        <var-decl name='cert_verify_hash' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16960'>
        <var-decl name='cert_verify_hash_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17024'>
        <var-decl name='hello_retry_request' type-id='type-id-462' visibility='default' filepath='ssl/ssl_local.h' line='1487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17088'>
        <var-decl name='sid_ctx_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='sid_ctx' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='1494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17408'>
        <var-decl name='session' type-id='type-id-463' visibility='default' filepath='ssl/ssl_local.h' line='1496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='psksession' type-id='type-id-463' visibility='default' filepath='ssl/ssl_local.h' line='1498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17536'>
        <var-decl name='psksession_id' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17600'>
        <var-decl name='psksession_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17664'>
        <var-decl name='generate_session_id' type-id='type-id-307' visibility='default' filepath='ssl/ssl_local.h' line='1502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='tmp_session_id' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='1507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='tmp_session_id_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='verify_mode' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='verify_callback' type-id='type-id-443' visibility='default' filepath='ssl/ssl_local.h' line='1516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='info_callback' type-id='type-id-439' visibility='default' filepath='ssl/ssl_local.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18240'>
        <var-decl name='error' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18272'>
        <var-decl name='error_code' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18304'>
        <var-decl name='psk_client_callback' type-id='type-id-313' visibility='default' filepath='ssl/ssl_local.h' line='1524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18368'>
        <var-decl name='psk_server_callback' type-id='type-id-315' visibility='default' filepath='ssl/ssl_local.h' line='1525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18432'>
        <var-decl name='psk_find_session_cb' type-id='type-id-317' visibility='default' filepath='ssl/ssl_local.h' line='1527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18496'>
        <var-decl name='psk_use_session_cb' type-id='type-id-319' visibility='default' filepath='ssl/ssl_local.h' line='1528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18560'>
        <var-decl name='verified_chain' type-id='type-id-210' visibility='default' filepath='ssl/ssl_local.h' line='1531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18624'>
        <var-decl name='verify_result' type-id='type-id-59' visibility='default' filepath='ssl/ssl_local.h' line='1532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18688'>
        <var-decl name='ca_names' type-id='type-id-440' visibility='default' filepath='ssl/ssl_local.h' line='1539' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18752'>
        <var-decl name='client_ca_names' type-id='type-id-440' visibility='default' filepath='ssl/ssl_local.h' line='1540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18816'>
        <var-decl name='options' type-id='type-id-7' visibility='default' filepath='ssl/ssl_local.h' line='1542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18880'>
        <var-decl name='mode' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18912'>
        <var-decl name='min_proto_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18944'>
        <var-decl name='max_proto_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19008'>
        <var-decl name='max_cert_list' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19072'>
        <var-decl name='first_packet' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1548' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19104'>
        <var-decl name='client_version' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19136'>
        <var-decl name='split_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19200'>
        <var-decl name='max_send_fragment' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19264'>
        <var-decl name='max_pipelines' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19328'>
        <var-decl name='ext' type-id='type-id-464' visibility='default' filepath='ssl/ssl_local.h' line='1681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21952'>
        <var-decl name='clienthello' type-id='type-id-465' visibility='default' filepath='ssl/ssl_local.h' line='1687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22016'>
        <var-decl name='servername_done' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22080'>
        <var-decl name='ct_validation_callback' type-id='type-id-326' visibility='default' filepath='ssl/ssl_local.h' line='1701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22144'>
        <var-decl name='ct_validation_callback_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22208'>
        <var-decl name='scts' type-id='type-id-466' visibility='default' filepath='ssl/ssl_local.h' line='1708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22272'>
        <var-decl name='scts_parsed' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22336'>
        <var-decl name='session_ctx' type-id='type-id-401' visibility='default' filepath='ssl/ssl_local.h' line='1712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='srtp_profiles' type-id='type-id-448' visibility='default' filepath='ssl/ssl_local.h' line='1715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22464'>
        <var-decl name='srtp_profile' type-id='type-id-467' visibility='default' filepath='ssl/ssl_local.h' line='1717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22528'>
        <var-decl name='renegotiate' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22560'>
        <var-decl name='key_update' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22592'>
        <var-decl name='post_handshake_auth' type-id='type-id-378' visibility='default' filepath='ssl/ssl_local.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22624'>
        <var-decl name='pha_enabled' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22656'>
        <var-decl name='pha_context' type-id='type-id-206' visibility='default' filepath='ssl/ssl_local.h' line='1730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22720'>
        <var-decl name='pha_context_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22784'>
        <var-decl name='certreqs_sent' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22848'>
        <var-decl name='pha_dgst' type-id='type-id-468' visibility='default' filepath='ssl/ssl_local.h' line='1733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22912'>
        <var-decl name='srp_ctx' type-id='type-id-405' visibility='default' filepath='ssl/ssl_local.h' line='1737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23936'>
        <var-decl name='not_resumable_session_cb' type-id='type-id-384' visibility='default' filepath='ssl/ssl_local.h' line='1743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24000'>
        <var-decl name='rlayer' type-id='type-id-377' visibility='default' filepath='ssl/ssl_local.h' line='1746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48064'>
        <var-decl name='default_passwd_callback' type-id='type-id-433' visibility='default' filepath='ssl/ssl_local.h' line='1749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48128'>
        <var-decl name='default_passwd_callback_userdata' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48192'>
        <var-decl name='job' type-id='type-id-469' visibility='default' filepath='ssl/ssl_local.h' line='1753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48256'>
        <var-decl name='waitctx' type-id='type-id-470' visibility='default' filepath='ssl/ssl_local.h' line='1754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48320'>
        <var-decl name='asyncrw' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48384'>
        <var-decl name='max_early_data' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48416'>
        <var-decl name='recv_max_early_data' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48448'>
        <var-decl name='early_data_count' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48512'>
        <var-decl name='num_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48576'>
        <var-decl name='sent_tickets' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48640'>
        <var-decl name='next_ticket_nonce' type-id='type-id-7' visibility='default' filepath='ssl/ssl_local.h' line='1780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48704'>
        <var-decl name='allow_early_data_cb' type-id='type-id-334' visibility='default' filepath='ssl/ssl_local.h' line='1783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48768'>
        <var-decl name='allow_early_data_cb_data' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1784' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48832'>
        <var-decl name='async_cb' type-id='type-id-305' visibility='default' filepath='ssl/ssl_local.h' line='1787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48896'>
        <var-decl name='async_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48960'>
        <var-decl name='shared_sigalgs' type-id='type-id-471' visibility='default' filepath='ssl/ssl_local.h' line='1794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49024'>
        <var-decl name='shared_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49088'>
        <var-decl name='cert_comp_prefs' type-id='type-id-148' visibility='default' filepath='ssl/ssl_local.h' line='1799' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49216'>
        <var-decl name='client_cert_type' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49280'>
        <var-decl name='client_cert_type_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49344'>
        <var-decl name='server_cert_type' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49408'>
        <var-decl name='server_cert_type_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1806' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='6848' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1270' column='1' id='type-id-460'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='type-id-59' visibility='default' filepath='ssl/ssl_local.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server_random' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='client_random' type-id='type-id-166' visibility='default' filepath='ssl/ssl_local.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='handshake_buffer' type-id='type-id-374' visibility='default' filepath='ssl/ssl_local.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='handshake_dgst' type-id='type-id-468' visibility='default' filepath='ssl/ssl_local.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='change_cipher_spec' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='warn_alert' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='fatal_alert' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='alert_dispatch' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='send_alert' type-id='type-id-165' visibility='default' filepath='ssl/ssl_local.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='renegotiate' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='total_renegotiations' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='num_renegotiations' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='in_read_app_data' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tmp' type-id='type-id-472' visibility='default' filepath='ssl/ssl_local.h' line='1383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='previous_client_finished' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='previous_client_finished_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='previous_server_finished' type-id='type-id-170' visibility='default' filepath='ssl/ssl_local.h' line='1388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='previous_server_finished_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='send_connection_binding' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='npn_seen' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='alpn_selected' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='alpn_selected_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='alpn_proposed' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='alpn_proposed_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='alpn_sent' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='is_probably_safari' type-id='type-id-1' visibility='default' filepath='ssl/ssl_local.h' line='1422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6760'>
        <var-decl name='did_kex' type-id='type-id-1' visibility='default' filepath='ssl/ssl_local.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6768'>
        <var-decl name='group_id' type-id='type-id-150' visibility='default' filepath='ssl/ssl_local.h' line='1432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='peer_tmp' type-id='type-id-202' visibility='default' filepath='ssl/ssl_local.h' line='1433' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='4224' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1305' column='1' id='type-id-472'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finish_md' type-id='type-id-160' visibility='default' filepath='ssl/ssl_local.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='finish_md_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='peer_finish_md' type-id='type-id-160' visibility='default' filepath='ssl/ssl_local.h' line='1309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='peer_finish_md_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='message_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='message_type' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='new_cipher' type-id='type-id-398' visibility='default' filepath='ssl/ssl_local.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='pkey' type-id='type-id-202' visibility='default' filepath='ssl/ssl_local.h' line='1315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='cert_req' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='ctype' type-id='type-id-206' visibility='default' filepath='ssl/ssl_local.h' line='1319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='ctype_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='peer_ca_names' type-id='type-id-440' visibility='default' filepath='ssl/ssl_local.h' line='1322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='key_block_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='key_block' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='new_sym_enc' type-id='type-id-142' visibility='default' filepath='ssl/ssl_local.h' line='1325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='new_hash' type-id='type-id-145' visibility='default' filepath='ssl/ssl_local.h' line='1326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='new_mac_pkey_type' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='new_mac_secret_size' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='new_compression' type-id='type-id-473' visibility='default' filepath='ssl/ssl_local.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='cert_request' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='ciphers_raw' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='ciphers_rawlen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='pms' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='pmslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='psk' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='psklen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='sigalg' type-id='type-id-474' visibility='default' filepath='ssl/ssl_local.h' line='1347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='cert' type-id='type-id-475' visibility='default' filepath='ssl/ssl_local.h' line='1349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='peer_sigalgs' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='peer_cert_sigalgs' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='peer_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='peer_cert_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='peer_sigalg' type-id='type-id-474' visibility='default' filepath='ssl/ssl_local.h' line='1362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='valid_flags' type-id='type-id-476' visibility='default' filepath='ssl/ssl_local.h' line='1368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='mask_k' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='mask_a' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='1375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='min_ver' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='max_ver' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1382' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='ssl/ssl_local.h' line='1486' column='1' id='type-id-462'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='SSL_HRR_NONE' value='0'/>
      <enumerator name='SSL_HRR_PENDING' value='1'/>
      <enumerator name='SSL_HRR_COMPLETE' value='2'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='2624' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1567' column='1' id='type-id-464'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extflags' type-id='type-id-157' visibility='default' filepath='ssl/ssl_local.h' line='1569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='debug_cb' type-id='type-id-477' visibility='default' filepath='ssl/ssl_local.h' line='1571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='debug_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='hostname' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='1574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='status_type' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='scts' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='scts_len' type-id='type-id-150' visibility='default' filepath='ssl/ssl_local.h' line='1581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='status_expected' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ocsp' type-id='type-id-478' visibility='default' filepath='ssl/ssl_local.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ticket_expected' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='extra_tickets_expected' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ecpointformats' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='peer_ecpointformats_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='peer_ecpointformats' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='supportedgroups' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='peer_supportedgroups_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='peer_supportedgroups' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='1611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='session_ticket' type-id='type-id-479' visibility='default' filepath='ssl/ssl_local.h' line='1614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='session_ticket_cb' type-id='type-id-295' visibility='default' filepath='ssl/ssl_local.h' line='1616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='session_ticket_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='session_secret_cb' type-id='type-id-297' visibility='default' filepath='ssl/ssl_local.h' line='1619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='session_secret_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='1620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='alpn' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='alpn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='npn' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='npn_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='psk_kex_mode' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='use_etm' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='early_data' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='early_data_ok' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tls13_cookie' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tls13_cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='cookieok' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='max_fragment_len_mode' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tick_identity' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='compress_certificate_from_peer' type-id='type-id-148' visibility='default' filepath='ssl/ssl_local.h' line='1673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='compress_certificate_sent' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='client_cert_type' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2568'>
        <var-decl name='client_cert_type_ctos' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='server_cert_type' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2584'>
        <var-decl name='server_cert_type_ctos' type-id='type-id-154' visibility='default' filepath='ssl/ssl_local.h' line='1680' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='ssl/ssl_local.h' line='1585' column='1' id='type-id-478'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ids' type-id='type-id-480' visibility='default' filepath='ssl/ssl_local.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exts' type-id='type-id-481' visibility='default' filepath='ssl/ssl_local.h' line='1588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resp' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resp_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1591' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sigalg_lookup_st' size-in-bits='320' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1845' column='1' id='type-id-482'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='1847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sigalg' type-id='type-id-150' visibility='default' filepath='ssl/ssl_local.h' line='1849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='hash' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash_idx' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sig' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sig_idx' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1857' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='sigandhash' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='curve' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='enabled' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1863' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dtls1_retransmit_state' size-in-bits='128' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1881' column='1' id='type-id-483'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wrlmethod' type-id='type-id-372' visibility='default' filepath='ssl/ssl_local.h' line='1882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wrl' type-id='type-id-373' visibility='default' filepath='ssl/ssl_local.h' line='1883' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='hm_header_st' size-in-bits='512' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1886' column='1' id='type-id-484'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-3' visibility='default' filepath='ssl/ssl_local.h' line='1887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='msg_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='seq' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='1889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frag_off' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='frag_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='is_ccs' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='1892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='saved_retransmit_state' type-id='type-id-483' visibility='default' filepath='ssl/ssl_local.h' line='1893' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pqueue' type-id='type-id-128' filepath='ssl/ssl_local.h' line='1902' column='1' id='type-id-485'/>
    <class-decl name='dtls1_state_st' size-in-bits='3840' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1925' column='1' id='type-id-486'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='type-id-163' visibility='default' filepath='ssl/ssl_local.h' line='1926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='cookie_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='cookie_verified' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='1928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='handshake_write_seq' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='1930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='next_handshake_write_seq' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='1931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='handshake_read_seq' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='1932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='buffered_messages' type-id='type-id-487' visibility='default' filepath='ssl/ssl_local.h' line='1934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='sent_messages' type-id='type-id-487' visibility='default' filepath='ssl/ssl_local.h' line='1936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='link_mtu' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='mtu' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='w_msg_hdr' type-id='type-id-484' visibility='default' filepath='ssl/ssl_local.h' line='1939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='r_msg_hdr' type-id='type-id-484' visibility='default' filepath='ssl/ssl_local.h' line='1940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='timeout_num_alerts' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='1942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='next_timeout' type-id='type-id-261' visibility='default' filepath='ssl/ssl_local.h' line='1946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='timeout_duration_us' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='1948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='retransmitting' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='1950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='shutdown_received' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='timer_cb' type-id='type-id-333' visibility='default' filepath='ssl/ssl_local.h' line='1955' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ossl_comp_cert_st' size-in-bits='256' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1967' column='1' id='type-id-488'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='orig_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='references' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='alg' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1972' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OSSL_COMP_CERT' type-id='type-id-488' filepath='ssl/ssl_local.h' line='1974' column='1' id='type-id-489'/>
    <class-decl name='cert_pkey_st' size-in-bits='640' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='1980' column='1' id='type-id-458'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x509' type-id='type-id-212' visibility='default' filepath='ssl/ssl_local.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='privatekey' type-id='type-id-202' visibility='default' filepath='ssl/ssl_local.h' line='1982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='chain' type-id='type-id-210' visibility='default' filepath='ssl/ssl_local.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='serverinfo' type-id='type-id-15' visibility='default' filepath='ssl/ssl_local.h' line='1992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='serverinfo_length' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='1993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='comp_cert' type-id='type-id-102' visibility='default' filepath='ssl/ssl_local.h' line='1996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cert_comp_used' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='1997' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='ENDPOINT' naming-typedef-id='type-id-490' filepath='ssl/ssl_local.h' line='2006' column='1' id='type-id-491'>
      <underlying-type type-id='type-id-159'/>
      <enumerator name='ENDPOINT_CLIENT' value='0'/>
      <enumerator name='ENDPOINT_SERVER' value='1'/>
      <enumerator name='ENDPOINT_BOTH' value='2'/>
    </enum-decl>
    <typedef-decl name='ENDPOINT' type-id='type-id-491' filepath='ssl/ssl_local.h' line='2010' column='1' id='type-id-490'/>
    <class-decl name='custom_ext_method' size-in-bits='448' is-struct='yes' naming-typedef-id='type-id-492' visibility='default' filepath='ssl/ssl_local.h' line='2013' column='1' id='type-id-493'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ext_type' type-id='type-id-173' visibility='default' filepath='ssl/ssl_local.h' line='2014' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='role' type-id='type-id-490' visibility='default' filepath='ssl/ssl_local.h' line='2015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context' type-id='type-id-20' visibility='default' filepath='ssl/ssl_local.h' line='2017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ext_flags' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='2022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='add_cb' type-id='type-id-299' visibility='default' filepath='ssl/ssl_local.h' line='2023' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='free_cb' type-id='type-id-301' visibility='default' filepath='ssl/ssl_local.h' line='2024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='add_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='2025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='parse_cb' type-id='type-id-303' visibility='default' filepath='ssl/ssl_local.h' line='2026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='parse_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='2027' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='custom_ext_method' type-id='type-id-493' filepath='ssl/ssl_local.h' line='2028' column='1' id='type-id-492'/>
    <class-decl name='custom_ext_methods' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-494' visibility='default' filepath='ssl/ssl_local.h' line='2043' column='1' id='type-id-495'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='meths' type-id='type-id-496' visibility='default' filepath='ssl/ssl_local.h' line='2044' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='meths_count' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2045' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='custom_ext_methods' type-id='type-id-495' filepath='ssl/ssl_local.h' line='2046' column='1' id='type-id-494'/>
    <class-decl name='cert_st' size-in-bits='1472' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='2048' column='1' id='type-id-497'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-475' visibility='default' filepath='ssl/ssl_local.h' line='2055' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dh_tmp' type-id='type-id-202' visibility='default' filepath='ssl/ssl_local.h' line='2057' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dh_tmp_cb' type-id='type-id-498' visibility='default' filepath='ssl/ssl_local.h' line='2058' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dh_tmp_auto' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='2059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cert_flags' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='2061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pkeys' type-id='type-id-475' visibility='default' filepath='ssl/ssl_local.h' line='2062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ssl_pkey_num' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2063' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ctype' type-id='type-id-206' visibility='default' filepath='ssl/ssl_local.h' line='2065' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctype_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='conf_sigalgs' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='2072' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conf_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2074' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='client_sigalgs' type-id='type-id-451' visibility='default' filepath='ssl/ssl_local.h' line='2082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='client_sigalgslen' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='cert_cb' type-id='type-id-304' visibility='default' filepath='ssl/ssl_local.h' line='2092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cert_cb_arg' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='2093' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='chain_store' type-id='type-id-499' visibility='default' filepath='ssl/ssl_local.h' line='2098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='verify_store' type-id='type-id-499' visibility='default' filepath='ssl/ssl_local.h' line='2099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='custext' type-id='type-id-494' visibility='default' filepath='ssl/ssl_local.h' line='2101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='sec_cb' type-id='type-id-500' visibility='default' filepath='ssl/ssl_local.h' line='2103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='sec_level' type-id='type-id-2' visibility='default' filepath='ssl/ssl_local.h' line='2106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='sec_ex' type-id='type-id-16' visibility='default' filepath='ssl/ssl_local.h' line='2107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='psk_identity_hint' type-id='type-id-10' visibility='default' filepath='ssl/ssl_local.h' line='2110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='references' type-id='type-id-240' visibility='default' filepath='ssl/ssl_local.h' line='2112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ssl3_enc_method' size-in-bits='896' is-struct='yes' visibility='default' filepath='ssl/ssl_local.h' line='2121' column='1' id='type-id-501'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='setup_key_block' type-id='type-id-502' visibility='default' filepath='ssl/ssl_local.h' line='2122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='generate_master_secret' type-id='type-id-503' visibility='default' filepath='ssl/ssl_local.h' line='2123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='change_cipher_state' type-id='type-id-504' visibility='default' filepath='ssl/ssl_local.h' line='2125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='final_finish_mac' type-id='type-id-505' visibility='default' filepath='ssl/ssl_local.h' line='2126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='client_finished_label' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='2128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='client_finished_label_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='server_finished_label' type-id='type-id-14' visibility='default' filepath='ssl/ssl_local.h' line='2130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='server_finished_label_len' type-id='type-id-8' visibility='default' filepath='ssl/ssl_local.h' line='2131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='alert_value' type-id='type-id-506' visibility='default' filepath='ssl/ssl_local.h' line='2132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='export_keying_material' type-id='type-id-507' visibility='default' filepath='ssl/ssl_local.h' line='2133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='enc_flags' type-id='type-id-19' visibility='default' filepath='ssl/ssl_local.h' line='2138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='set_handshake_header' type-id='type-id-508' visibility='default' filepath='ssl/ssl_local.h' line='2140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='close_construct_packet' type-id='type-id-508' visibility='default' filepath='ssl/ssl_local.h' line='2142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='do_write' type-id='type-id-502' visibility='default' filepath='ssl/ssl_local.h' line='2144' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-470'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-509'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-475'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-465'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-408'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-512'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-498'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-514'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-515'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-516'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-517'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-519'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-520'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-442'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-401'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-523'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-524'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-481'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-499'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-526'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-528'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-266' const='yes' id='type-id-530'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-239'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-537'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-142'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-538'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-205'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-539'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <qualified-type-def type-id='type-id-360' const='yes' id='type-id-541'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-543'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-544'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-546'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-389'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-549'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-550'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-551'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-553'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-555'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-501' const='yes' id='type-id-556'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-557'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' id='type-id-558'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-559'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-560'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-496'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-392'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-563' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-576' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-436'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-594' size-in-bits='64' id='type-id-306'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-504'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-507'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-503'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-432'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' id='type-id-325'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' id='type-id-500'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-390'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-506'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-443'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-613' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-397'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-487'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-619'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-620'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-621'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-425'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-438'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-440'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-622'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-625' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-627' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-630'/>
    <pointer-type-def type-id='type-id-631' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-633' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-634'/>
    <pointer-type-def type-id='type-id-635' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-640' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-642' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-439'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-645' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-426'/>
    <class-decl name='X509_VERIFY_PARAM_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='async_job_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-111'/>
    <class-decl name='async_wait_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <class-decl name='bignum_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='bio_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='comp_method_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='ct_policy_eval_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='ctlog_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='dh_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='engine_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='evp_cipher_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='evp_cipher_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='evp_mac_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='evp_md_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='evp_md_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='evp_pkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='hmac_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='ossl_record_layer_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='pqueue_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='stack_st_OCSP_RESPID' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='stack_st_SCT' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <class-decl name='stack_st_SRTP_PROTECTION_PROFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-131'/>
    <class-decl name='stack_st_SSL_CIPHER' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-132'/>
    <class-decl name='stack_st_SSL_COMP' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-133'/>
    <class-decl name='stack_st_X509' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-134'/>
    <class-decl name='stack_st_X509_EXTENSION' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
    <class-decl name='stack_st_X509_NAME' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-136'/>
    <class-decl name='stack_st_danetls_record' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-137'/>
    <class-decl name='stack_st_void' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-138'/>
    <class-decl name='x509_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-139'/>
    <class-decl name='x509_store_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-140'/>
    <class-decl name='x509_store_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-622'/>
      <return type-id='type-id-188'/>
    </function-decl>
    <function-decl name='BIO_set_flags' filepath='include/openssl/bio.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_clear_flags' filepath='include/openssl/bio.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_method_type' filepath='include/openssl/bio.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-529'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_new' filepath='include/openssl/bio.h' line='721' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-531'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_free' filepath='include/openssl/bio.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_set_data' filepath='include/openssl/bio.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_get_data' filepath='include/openssl/bio.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='BIO_set_init' filepath='include/openssl/bio.h' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_get_init' filepath='include/openssl/bio.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_set_shutdown' filepath='include/openssl/bio.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_get_shutdown' filepath='include/openssl/bio.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_up_ref' filepath='include/openssl/bio.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_write' filepath='include/openssl/bio.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_ctrl' filepath='include/openssl/bio.h' line='747' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='BIO_callback_ctrl' filepath='include/openssl/bio.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-511'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='BIO_push' filepath='include/openssl/bio.h' line='751' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_find_type' filepath='include/openssl/bio.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_next' filepath='include/openssl/bio.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_set_next' filepath='include/openssl/bio.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_get_retry_reason' filepath='include/openssl/bio.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_set_retry_reason' filepath='include/openssl/bio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='BIO_s_connect' filepath='include/openssl/bio.h' line='775' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-531'/>
    </function-decl>
    <function-decl name='BIO_f_buffer' filepath='include/openssl/bio.h' line='783' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-531'/>
    </function-decl>
    <function-decl name='BIO_copy_next_retry' filepath='include/openssl/bio.h' line='925' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='OSSL_QUIC_client_method' mangled-name='OSSL_QUIC_client_method' filepath='include/openssl/quic.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='OSSL_QUIC_client_method@@OPENSSL_3.2.0'>
      <return type-id='type-id-424'/>
    </function-decl>
    <function-decl name='OSSL_QUIC_client_thread_method' mangled-name='OSSL_QUIC_client_thread_method' filepath='include/openssl/quic.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='OSSL_QUIC_client_thread_method@@OPENSSL_3.2.0'>
      <return type-id='type-id-424'/>
    </function-decl>
    <function-decl name='SSL_clear' mangled-name='SSL_clear' filepath='include/openssl/ssl.h' line='1643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_clear@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_pending' mangled-name='SSL_pending' filepath='include/openssl/ssl.h' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_pending@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-545'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_set_bio' mangled-name='SSL_set_bio' filepath='include/openssl/ssl.h' line='1676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_set_bio@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <parameter type-id='type-id-374'/>
      <parameter type-id='type-id-374'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='SSL_get_rbio' mangled-name='SSL_get_rbio' filepath='include/openssl/ssl.h' line='1677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_get_rbio@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-545'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='SSL_get_wbio' mangled-name='SSL_get_wbio' filepath='include/openssl/ssl.h' line='1678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_get_wbio@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-545'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='SSL_copy_session_id' mangled-name='SSL_copy_session_id' filepath='include/openssl/ssl.h' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_copy_session_id@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <parameter type-id='type-id-545'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_new' mangled-name='SSL_new' filepath='include/openssl/ssl.h' line='1872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_new@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-520'/>
    </function-decl>
    <function-decl name='SSL_free' mangled-name='SSL_free' filepath='include/openssl/ssl.h' line='1975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_free@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='SSL_get_error' mangled-name='SSL_get_error' filepath='include/openssl/ssl.h' line='2023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_get_error@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-545'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_do_handshake' mangled-name='SSL_do_handshake' filepath='include/openssl/ssl.h' line='2102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_do_handshake@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_renegotiate' mangled-name='SSL_renegotiate' filepath='include/openssl/ssl.h' line='2105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_renegotiate@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_shutdown' mangled-name='SSL_shutdown' filepath='include/openssl/ssl.h' line='2109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_shutdown@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_set_connect_state' mangled-name='SSL_set_connect_state' filepath='include/openssl/ssl.h' line='2137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_set_connect_state@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='SSL_set_accept_state' mangled-name='SSL_set_accept_state' filepath='include/openssl/ssl.h' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_set_accept_state@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='SSL_dup' mangled-name='SSL_dup' filepath='include/openssl/ssl.h' line='2149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_dup@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-520'/>
      <return type-id='type-id-520'/>
    </function-decl>
    <function-decl name='SSL_get_rpoll_descriptor' mangled-name='SSL_get_rpoll_descriptor' filepath='include/openssl/ssl.h' line='2337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_get_rpoll_descriptor@@OPENSSL_3.2.0'>
      <parameter type-id='type-id-520'/>
      <parameter type-id='type-id-510'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='SSL_get_wpoll_descriptor' mangled-name='SSL_get_wpoll_descriptor' filepath='include/openssl/ssl.h' line='2338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='SSL_get_wpoll_descriptor@@OPENSSL_3.2.0'>
      <parameter type-id='type-id-520'/>
      <parameter type-id='type-id-510'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='BIO_f_ssl' mangled-name='BIO_f_ssl' filepath='ssl/bio_ssl.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='BIO_f_ssl@@OPENSSL_3.0.0'>
      <return type-id='type-id-531'/>
    </function-decl>
    <function-decl name='BIO_new_buffer_ssl_connect' mangled-name='BIO_new_buffer_ssl_connect' filepath='ssl/bio_ssl.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='BIO_new_buffer_ssl_connect@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-401' name='ctx' filepath='ssl/bio_ssl.c' line='436' column='1'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_new_ssl_connect' mangled-name='BIO_new_ssl_connect' filepath='ssl/bio_ssl.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='BIO_new_ssl_connect@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-401' name='ctx' filepath='ssl/bio_ssl.c' line='461' column='1'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_new_ssl' mangled-name='BIO_new_ssl' filepath='ssl/bio_ssl.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='BIO_new_ssl@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-401' name='ctx' filepath='ssl/bio_ssl.c' line='487' column='1'/>
      <parameter type-id='type-id-2' name='client' filepath='ssl/bio_ssl.c' line='487' column='1'/>
      <return type-id='type-id-374'/>
    </function-decl>
    <function-decl name='BIO_ssl_copy_session_id' mangled-name='BIO_ssl_copy_session_id' filepath='ssl/bio_ssl.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='BIO_ssl_copy_session_id@@OPENSSL_3.0.0'>
      <parameter type-id='type-id-374' name='t' filepath='ssl/bio_ssl.c' line='507' column='1'/>
